const { ethers } = require("ethers");

// 连接到以太坊网络
const provider = new ethers.providers.JsonRpcProvider(
  // "https://mainnet.infura.io/v3/23a9ce843eaf4f59871ea1857d7e7045" // infura 个人版
  // "https://sepolia.infura.io/v3/23a9ce843eaf4f59871ea1857d7e7045"
  "https://rpc.ankr.com/eth" // ankr 免费版，比较慢
  // "https://rpc.ankr.com/eth/f34f4caa367e4d7c1ce9c1c636e1f9d1700eb8dee1f6fcbc42e2cd7bcf7f59d0" // ankr 个人版，免费
);

// provider
//   .getBlockNumber()
//   .then((blockNumber) => {
//     console.log("blockNumber", blockNumber);
//     process.exit(0);
//   })
//   .catch((e) => {
//     console.log(e);
//     process.exit(0);
//   });

async function estimateTransactionFee(message = "") {
  const sender = "0xa5DB40FDB4fFeD319AccF5729E1fCE5A6bE6b20B";
  const receiver = "0xa5DB40FDB4fFeD319AccF5729E1fCE5A6bE6b20B";
  const value = ethers.utils.parseEther("0");
  const data = ethers.utils.toUtf8Bytes(message);
  // const data = ethers.utils.toUtf8Bytes(
  //   "可以使用 SSH（安全外壳协议）在 GitHub 上的存储库中访问和写入数据。 通过 SSH 进行连接时，使用本地计算机上的私钥文件进行身份验证。 有关详细信息，请参阅“关于 SSH”。生成 SSH 密钥时，可以添加密码以进一步保护密钥。 每当使用密钥时，都必须输入密码。 如果密钥具有密码并且你不想每次使用密钥时都输入密码，则可以将密钥添加到 SSH 代理。 SSH 代理会管理 SSH 密钥并密钥"
  // );
  // 这个是一个链上合约的 tx，可以用来检测 estimateTransactionFee 是否准确
  // const sender = "0x755B68C97733680c1e123e1fdE0a063F0CA7683f";
  // const receiver = "0x0000000000001fF3684f28c67538d4D072C22734";
  // const value = ethers.utils.parseEther("0.0022");
  // const data = `0x2213bc0b00000000000000000000000070bf6634ee8cb27d04478f184b9b8bb13e5f471000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000007d0e36a81800000000000000000000000000070bf6634ee8cb27d04478f184b9b8bb13e5f471000000000000000000000000000000000000000000000000000000000000000a000000000000000000000000000000000000000000000000000000000000004c41fff991f000000000000000000000000755b68c97733680c1e123e1fde0a063f0ca7683f00000000000000000000000032b86b99441480a7e5bd3a26c124ec2373e3f015000000000000000000000000000000000000000001a37e1a4ccfe5b135e06d0400000000000000000000000000000000000000000000000000000000000000a02fdcbc723207024d503c68f52068d400000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000003000000000000000000000000000000000000000000000000000000000000006000000000000000000000000000000000000000000000000000000000000001a000000000000000000000000000000000000000000000000000000000000002a0000000000000000000000000000000000000000000000000000000000000010438c9c147000000000000000000000000eeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeee0000000000000000000000000000000000000000000000000000000000002710000000000000000000000000c02aaa39b223fe8d0a0e5c4f27ead9083c756cc2000000000000000000000000000000000000000000000000000000000000000400000000000000000000000000000000000000000000000000000000000000a00000000000000000000000000000000000000000000000000000000000000024d0e30db00000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000c4103b48be00000000000000000000000070bf6634ee8cb27d04478f184b9b8bb13e5f4710000000000000000000000000c02aaa39b223fe8d0a0e5c4f27ead9083c756cc2000000000000000000000000000000000000000000000000000000000000271000000000000000000000000029c830864930c897efa2b9e9851342187b82010e0000000000000000000000000000000000000000000000000000000000001e00000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000012438c9c14700000000000000000000000032b86b99441480a7e5bd3a26c124ec2373e3f015000000000000000000000000000000000000000000000000000000000000005500000000000000000000000032b86b99441480a7e5bd3a26c124ec2373e3f015000000000000000000000000000000000000000000000000000000000000002400000000000000000000000000000000000000000000000000000000000000a00000000000000000000000000000000000000000000000000000000000000044a9059cbb0000000000000000000000007afa9d836d2fccf172b66622625e56404e465dbd0000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000`;

  // 构建交易
  const transaction = {
    from: sender,
    to: receiver,
    value,
    data,
  };

  // 获取预估的 Gas Limit
  const estimatedGas = await provider.estimateGas(transaction);
  // 获取当前 Gas Price
  const gasPrice = await provider.getGasPrice();
  // 计算预估交易费用
  const estimatedFee = estimatedGas.mul(gasPrice); // BigNumber 乘法
  console.log(`Estimated Gas: ${estimatedGas.toString()}`);
  console.log(`Gas Price: ${ethers.utils.formatUnits(gasPrice, "gwei")} Gwei`);
  console.log(
    `Estimated Transaction Fee: ${ethers.utils.formatEther(estimatedFee)} ETH`
  );

  process.exit(0);
}

function textToHex(text) {
  return (
    "0x" +
    Array.from(text)
      .map((char) => char.charCodeAt(0).toString(16).padStart(2, "0"))
      .join("")
  );
}

const text = `
  第29届LG杯世界围棋棋王战决赛事件

22日进行的次局比赛开局约半小时、棋局进行至第44手时，现场裁判判定柯洁违规，原因是柯洁在第18手提子后，未依照韩国棋院在2024年年底新修改的棋局规则将棋子放在棋盒盖中。中方提出异议称规则并未明确规定放置棋子的具体时间，韩方未同意，柯洁被罚两目。比赛在中断了约半个小时后继续，柯洁在第80手提子后又未将棋子放置在位于棋盘左侧的棋盒盖中，卞相壹应以81手，并在柯洁落下第82手后暂时离开座位倒水时举手向裁判投诉，柯洁迅速回到座位放置棋子但依然被裁判判定第二次违规，直接判负。

23日第三局比赛中柯洁提子时拨棋没拨到棋盒里，随后卞相壹思考的时候裁判介入暂停比赛。众所周知，围棋比赛中两位选手的剩余思考时间，直接关系到比赛的结果。今天比赛暂停时，卞相壹正面临一个非常重要的选择时刻。此时比赛暂停，不需要动用卞相壹的剩余比赛时间，给了他充分的时间思考接下来的落子可能产生的结果。第29届LG杯世界围棋棋王战决赛事件

22日进行的次局比赛开局约半小时、棋局进行至第44手时，现场裁判判定柯洁违规，原因是柯洁在第18手提子后，未依照韩国棋院在2024年年底新修改的棋局规则将棋子放在棋盒盖中。中方提出异议称规则并未明确规定放置棋子的具体时间，韩方未同意，柯洁被罚两目。比赛在中断了约半个小时后继续，柯洁在第80手提子后又未将棋子放置在位于棋盘左侧的棋盒盖中，卞相壹应以81手，并在柯洁落下第82手后暂时离开座位倒水时举手向裁判投诉，柯洁迅速回到座位放置棋子但依然被裁判判定第二次违规，直接判负。

23日第三局比赛中柯洁提子时拨棋没拨到棋盒里，随后卞相壹思考的时候裁判介入暂停比赛。众所周知，围棋比赛中两位选手的剩余思考时间，直接关系到比赛的结果。今天比赛暂停时，卞相壹正面临一个非常重要的选择时刻。此时比赛暂停，不需要动用卞相壹的剩余比赛时间，给了他充分的时间思考接下来的落子可能产生的结果。第29届LG杯世界围棋棋王战决赛事件

22日进行的次局比赛开局约半小时、棋局进行至第44手时，现场裁判判定柯洁违规，原因是柯洁在第18手提子后，未依照韩国棋院在2024年年底新修改的棋局规则将棋子放在棋盒盖中。中方提出异议称规则并未明确规定放置棋子的具体时间，韩方未同意，柯洁被罚两目。比赛在中断了约半个小时后继续，柯洁在第80手提子后又未将棋子放置在位于棋盘左侧的棋盒
  `;
const hexResult = textToHex(text);

console.log(hexResult);

// estimateTransactionFee(`
//   第29届LG杯世界围棋棋王战决赛事件

// 22日进行的次局比赛开局约半小时、棋局进行至第44手时，现场裁判判定柯洁违规，原因是柯洁在第18手提子后，未依照韩国棋院在2024年年底新修改的棋局规则将棋子放在棋盒盖中。中方提出异议称规则并未明确规定放置棋子的具体时间，韩方未同意，柯洁被罚两目。比赛在中断了约半个小时后继续，柯洁在第80手提子后又未将棋子放置在位于棋盘左侧的棋盒盖中，卞相壹应以81手，并在柯洁落下第82手后暂时离开座位倒水时举手向裁判投诉，柯洁迅速回到座位放置棋子但依然被裁判判定第二次违规，直接判负。

// 23日第三局比赛中柯洁提子时拨棋没拨到棋盒里，随后卞相壹思考的时候裁判介入暂停比赛。众所周知，围棋比赛中两位选手的剩余思考时间，直接关系到比赛的结果。今天比赛暂停时，卞相壹正面临一个非常重要的选择时刻。此时比赛暂停，不需要动用卞相壹的剩余比赛时间，给了他充分的时间思考接下来的落子可能产生的结果。第29届LG杯世界围棋棋王战决赛事件

// 22日进行的次局比赛开局约半小时、棋局进行至第44手时，现场裁判判定柯洁违规，原因是柯洁在第18手提子后，未依照韩国棋院在2024年年底新修改的棋局规则将棋子放在棋盒盖中。中方提出异议称规则并未明确规定放置棋子的具体时间，韩方未同意，柯洁被罚两目。比赛在中断了约半个小时后继续，柯洁在第80手提子后又未将棋子放置在位于棋盘左侧的棋盒盖中，卞相壹应以81手，并在柯洁落下第82手后暂时离开座位倒水时举手向裁判投诉，柯洁迅速回到座位放置棋子但依然被裁判判定第二次违规，直接判负。

// 23日第三局比赛中柯洁提子时拨棋没拨到棋盒里，随后卞相壹思考的时候裁判介入暂停比赛。众所周知，围棋比赛中两位选手的剩余思考时间，直接关系到比赛的结果。今天比赛暂停时，卞相壹正面临一个非常重要的选择时刻。此时比赛暂停，不需要动用卞相壹的剩余比赛时间，给了他充分的时间思考接下来的落子可能产生的结果。第29届LG杯世界围棋棋王战决赛事件

// 22日进行的次局比赛开局约半小时、棋局进行至第44手时，现场裁判判定柯洁违规，原因是柯洁在第18手提子后，未依照韩国棋院在2024年年底新修改的棋局规则将棋子放在棋盒盖中。中方提出异议称规则并未明确规定放置棋子的具体时间，韩方未同意，柯洁被罚两目。比赛在中断了约半个小时后继续，柯洁在第80手提子后又未将棋子放置在位于棋盘左侧的棋盒
//   `).catch((e) => {
//   console.log(e);
//   process.exit(1);
// });
